/*
* Изучить правила игры в Blackjack.
* Подумать, как написать данную игру на С++, используя объектно-ориентированное программирование.
* Сколько будет классов в программе? Какие классы будут базовыми, а какие производными?
* ===============================================================================================
* В программе будут следующие классы:
* Card - для описания отдельной карты
* Deck - для описания колоды карт
* Player - для описания игрока
* Hand - для описания расклада на руках
* Game - для описания правил и процесса игры
*/